src/main/resources/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:exa="http://example.com/weather">
    <soapenv:Header/>
    <soapenv:Body>
        <exa:GetWeatherRequest>
            <exa:city>Istanbul</exa:city>
        </exa:GetWeatherRequest>
    </soapenv:Body>
</soapenv:Envelope>
